betaflight/betaflight/src/platform/STM32/include/platform/platform.h
/*
 * This file is part of Cleanflight and Betaflight.
 *
 * Cleanflight and Betaflight are free software. You can redistribute
 * this software and/or modify this software under the terms of the
 * GNU General Public License as published by the Free Software
 * Foundation, either version 3 of the License, or (at your option)
 * any later version.
 *
 * Cleanflight and Betaflight are distributed in the hope that they
 * will be useful, but WITHOUT ANY WARRANTY; without even the implied
 * warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 * See the GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this software.
 *
 * If not, see <http://www.gnu.org/licenses/>.
 */

#pragma once

#if defined(STM32G474xx)
#include "stm32g4xx.h"
#include "stm32g4xx_hal.h"
#include "system_stm32g4xx.h"

#include "stm32g4xx_ll_spi.h"
#include "stm32g4xx_ll_usart.h"
#include "stm32g4xx_ll_gpio.h"
#include "stm32g4xx_ll_dma.h"
#include "stm32g4xx_ll_rcc.h"
#include "stm32g4xx_ll_bus.h"
#include "stm32g4xx_ll_tim.h"
#include "stm32g4xx_ll_i2c.h"
#include "stm32g4xx_ll_system.h"
#include "stm32g4xx_ll_ex.h"

// Chip Unique ID on G4
#define U_ID_0 (*(uint32_t*)UID_BASE)
#define U_ID_1 (*(uint32_t*)(UID_BASE + 4))
#define U_ID_2 (*(uint32_t*)(UID_BASE + 8))

#define SPI_TRAIT_AF_PIN 1
#define I2C_TRAIT_AF_PIN 1

#ifndef STM32G4
#define STM32G4
#endif

#elif defined(STM32H743xx) || defined(STM32H750xx) || defined(STM32H7A3xx) || defined(STM32H7A3xxQ) || defined(STM32H723xx) || defined(STM32H725xx) || defined(STM32H730xx) || defined(STM32H735xx) || defined(STM32H757xx)
#include "stm32h7xx.h"
#include "stm32h7xx_hal.h"
#include "system_stm32h7xx.h"

#include "stm32h7xx_ll_spi.h"
#include "stm32h7xx_ll_usart.h"
#include "stm32h7xx_ll_gpio.h"
#include "stm32h7xx_ll_dma.h"
#include "stm32h7xx_ll_rcc.h"
#include "stm32h7xx_ll_bus.h"
#include "stm32h7xx_ll_tim.h"
#include "stm32h7xx_ll_i2c.h"
#include "stm32h7xx_ll_system.h"
#include "stm32h7xx_ll_ex.h"

// Chip Unique ID on H7
// M4 core cannot access system memory where UID is stored
#ifndef CORE_CM4
#define U_ID_0 (*(uint32_t*)UID_BASE)
#define U_ID_1 (*(uint32_t*)(UID_BASE + 4))
#define U_ID_2 (*(uint32_t*)(UID_BASE + 8))
#else
#define U_ID_0 0
#define U_ID_1 0
#define U_ID_2 0
#endif

#define SPI_TRAIT_AF_PIN 1
#define I2C_TRAIT_AF_PIN 1

#ifndef STM32H7
#define STM32H7
#endif

// M4 core on dual-core H7 (H745/H747/H755/H757) has no cache
#if defined(CORE_CM4)
#define SCB_EnableICache()      ((void)0)
#define SCB_DisableICache()     ((void)0)
#define SCB_EnableDCache()      ((void)0)
#define SCB_DisableDCache()     ((void)0)
#define SCB_InvalidateDCache_by_Addr(addr, size)  ((void)0)
#define SCB_CleanDCache_by_Addr(addr, size)       ((void)0)
// Map single-core reset flag to M4's reset flag for dual-core
#define RCC_RSR_SFTRSTF         RCC_RSR_SFT2RSTF
#endif

// On dual-core H7 (H745/H747/H755/H757), the single-core RCC_RSR_SFTRSTF
// symbol does not exist; M7's reset flag is RCC_RSR_SFT1RSTF. Map it here so
// shared code that checks the soft-reset flag works on the M7 side too.
#if defined(CORE_CM7) && defined(STM32H757xx)
#define RCC_RSR_SFTRSTF         RCC_RSR_SFT1RSTF
#endif

#elif defined(STM32H563xx) || defined(STM32H562xx)
#include "stm32h5xx.h"
#include "stm32h5xx_hal.h"
#include "system_stm32h5xx.h"

#include "stm32h5xx_ll_spi.h"
#include "stm32h5xx_ll_usart.h"
#include "stm32h5xx_ll_gpio.h"
#include "stm32h5xx_ll_dma.h"
#include "stm32h5xx_ll_rcc.h"
#include "stm32h5xx_ll_bus.h"
#include "stm32h5xx_ll_i2c.h"
#include "stm32h5xx_ll_tim.h"
#include "stm32h5xx_ll_system.h"
#include "stm32h5xx_ll_ex.h"

// Chip Unique ID on H5
#define U_ID_0 (*(uint32_t*)UID_BASE)
#define U_ID_1 (*(uint32_t*)(UID_BASE + 4))
#define U_ID_2 (*(uint32_t*)(UID_BASE + 8))

#define SPI_TRAIT_AF_PIN 1
#define I2C_TRAIT_AF_PIN 1

#ifndef STM32H5
#define STM32H5
#endif

#elif defined(STM32F722xx) || defined(STM32F745xx) || defined(STM32F746xx) || defined(STM32F765xx)
#include "stm32f7xx.h"
#include "stm32f7xx_hal.h"
#include "system_stm32f7xx.h"

#include "stm32f7xx_ll_spi.h"
#include "stm32f7xx_ll_usart.h"
#include "stm32f7xx_ll_gpio.h"
#include "stm32f7xx_ll_dma.h"
#include "stm32f7xx_ll_rcc.h"
#include "stm32f7xx_ll_bus.h"
#include "stm32f7xx_ll_tim.h"
#include "stm32f7xx_ll_i2c.h"
#include "stm32f7xx_ll_system.h"
#include "stm32f7xx_ll_ex.h"

// Chip Unique ID on F7
#define U_ID_0 (*(uint32_t*)UID_BASE)
#define U_ID_1 (*(uint32_t*)(UID_BASE + 4))
#define U_ID_2 (*(uint32_t*)(UID_BASE + 8))

#define SPI_TRAIT_AF_PIN 1

#ifndef STM32F7
#define STM32F7
#endif

#elif defined(STM32F40_41xxx) || defined(STM32F411xE) || defined(STM32F446xx)

#include "stm32f4xx.h"

// Chip Unique ID on F405
#define U_ID_0 (*(uint32_t*)0x1fff7a10)
#define U_ID_1 (*(uint32_t*)0x1fff7a14)
#define U_ID_2 (*(uint32_t*)0x1fff7a18)

#define SPI_TRAIT_AF_PORT 1

#define I2C_TRAIT_STATE 1
#define I2C_TRAIT_AF_PIN 1

#define GPIO_PIN_RESET 0

#ifndef STM32F4
#define STM32F4
#endif

#elif defined(STM32C591xx) || defined(STM32C562xx)
#include "stm32c5xx.h"
#include "stm32c5xx_hal.h"
// HAL2: module headers must be included explicitly (hal_conf.h only defines enables)
#include "stm32c5xx_hal_rcc.h"
#include "stm32c5xx_hal_gpio.h"
#include "stm32c5xx_hal_dma.h"
#include "stm32c5xx_hal_cortex.h"
#include "stm32c5xx_hal_flash.h"
#include "stm32c5xx_hal_pwr.h"
#include "stm32c5xx_hal_tim.h"
#include "stm32c5xx_hal_tamp.h"
#include "system_stm32c5xx.h"

#include "stm32c5xx_ll_spi.h"
#include "stm32c5xx_ll_usart.h"
#include "stm32c5xx_ll_gpio.h"
#include "stm32c5xx_ll_dma.h"
#include "stm32c5xx_ll_rcc.h"
#include "stm32c5xx_ll_bus.h"
#include "stm32c5xx_ll_tim.h"
#include "stm32c5xx_ll_i2c.h"
#include "stm32c5xx_ll_system.h"

// HAL2 compat must come AFTER all HAL/LL headers (needs their types)
#include "stm32c5xx_hal2_compat.h"
#include "stm32c5xx_ll_ex.h"

// Chip Unique ID on C5
#define U_ID_0 (*(uint32_t*)UID_BASE)
#define U_ID_1 (*(uint32_t*)(UID_BASE + 4))
#define U_ID_2 (*(uint32_t*)(UID_BASE + 8))

#define USE_PIN_AF

#define SPI_TRAIT_AF_PIN 1
#define I2C_TRAIT_AF_PIN 1

#ifndef STM32C5
#define STM32C5
#endif

