betaflight/betaflight/src/platform/STM32/include/platform/platform.h
#elif defined(STM32N657xx)
#include "stm32n6xx.h"
#include "partition_stm32n6xx.h"
#include "stm32n6xx_hal.h"
#include "system_stm32n6xx.h"

#include "stm32n6xx_ll_spi.h"
#include "stm32n6xx_ll_usart.h"
#include "stm32n6xx_ll_gpio.h"
#include "stm32n6xx_ll_dma.h"
#include "stm32n6xx_ll_rcc.h"
#include "stm32n6xx_ll_bus.h"
#include "stm32n6xx_ll_tim.h"
#include "stm32n6xx_ll_i2c.h"
#include "stm32n6xx_ll_system.h"
#include "stm32n6xx_ll_ex.h"

// Chip Unique ID on N6
#define U_ID_0 (*(uint32_t*)UID_BASE)
#define U_ID_1 (*(uint32_t*)(UID_BASE + 4))
#define U_ID_2 (*(uint32_t*)(UID_BASE + 8))

#define USE_PIN_AF

#define SPI_TRAIT_AF_PIN 1
#define I2C_TRAIT_AF_PIN 1

#ifndef STM32N6
#define STM32N6
#endif

// N6 boots from external XSPI flash in memory-mapped mode
#if !defined(USE_FLASH_MEMORY_MAPPED) && !defined(CONFIG_IN_RAM) && !defined(CONFIG_IN_SDCARD)
#define USE_FLASH_MEMORY_MAPPED
#endif

#endif // MCU family selection

#ifdef STM32F4
#if defined(STM32F40_41xxx)
#define USE_FAST_DATA
#endif

#define USE_RPM_FILTER
#define USE_DYN_IDLE
#define USE_DYN_NOTCH_FILTER
#define USE_ADC_INTERNAL
#define USE_USB_CDC_HID
#define USE_USB_MSC
#define USE_PERSISTENT_MSC_RTC
#define USE_MCO
#define USE_MCO_DEVICE2
#define USE_DMA_SPEC
#define USE_PERSISTENT_OBJECTS
#define USE_LATE_TASK_STATISTICS

#if defined(STM32F40_41xxx)
#define USE_OVERCLOCK
#define ENABLE_OVERCLOCK_192_MHZ 1
#define ENABLE_OVERCLOCK_216_MHZ 1
#define ENABLE_OVERCLOCK_240_MHZ 1
#elif defined(STM32F411xE)
#define USE_OVERCLOCK
#define ENABLE_OVERCLOCK_108_MHZ 1
#define ENABLE_OVERCLOCK_120_MHZ 1
#endif
#endif // STM32F4

#ifdef STM32F7
#define USE_ITCM_RAM
#define ITCM_RAM_OPTIMISATION "-O2", "-freorder-blocks-algorithm=simple"
#define USE_FAST_DATA
#define USE_RPM_FILTER
#define USE_DYN_IDLE
#define USE_DYN_NOTCH_FILTER
#define USE_OVERCLOCK
#define ENABLE_OVERCLOCK_240_MHZ 1
#define USE_ADC_INTERNAL
#define USE_USB_CDC_HID
#define USE_USB_MSC
#define USE_PERSISTENT_MSC_RTC
#define USE_MCO
#define USE_MCO_DEVICE2
#define USE_DMA_SPEC
#define USE_PERSISTENT_OBJECTS
#define USE_LATE_TASK_STATISTICS
// SERIAL_CHECK_TX is broken on F7, skip it unless USE_F7_CHECK_TX is defined
#if !defined(USE_F7_CHECK_TX)
#define ENABLE_SERIAL_SKIP_CHECK_TX 1
#endif
#endif // STM32F7

#ifdef STM32H7

// M4 core (dual-core H7) has no cache or ITCM
#if defined(USE_DSHOT) && !defined(CORE_CM4)
#define USE_DSHOT_CACHE_MGMT
#endif

#ifndef CORE_CM4
#define USE_ITCM_RAM
#endif
#define USE_FAST_DATA
#define USE_RPM_FILTER
#define USE_DYN_IDLE
#define USE_DYN_NOTCH_FILTER
#ifndef CORE_CM4
#define USE_ADC_INTERNAL
#endif
#define USE_USB_CDC_HID
#define USE_DMA_SPEC
#define USE_PERSISTENT_OBJECTS
#define USE_DMA_RAM
#if !defined(ENABLE_AFATFS_DMA_CACHE)
#define ENABLE_AFATFS_DMA_CACHE 1
#endif
#define USE_USB_MSC
#define USE_RTC_TIME
#define USE_PERSISTENT_MSC_RTC
#define USE_LATE_TASK_STATISTICS
#if !defined(ENABLE_CAN)
#define ENABLE_CAN 1
#endif
#endif

#ifdef STM32G4
#define USE_RPM_FILTER
#define USE_DYN_IDLE
#define USE_OVERCLOCK
#define ENABLE_OVERCLOCK_192_MHZ 1
#define ENABLE_OVERCLOCK_216_MHZ 1
#define ENABLE_OVERCLOCK_240_MHZ 1
#define USE_DYN_NOTCH_FILTER
#define USE_ADC_INTERNAL
#define USE_USB_MSC
#define USE_USB_CDC_HID
#define USE_MCO
#define USE_MCO_DEVICE1
#define USE_DMA_SPEC
#define USE_LATE_TASK_STATISTICS
#if !defined(ENABLE_CAN)
#define ENABLE_CAN 1
#endif
#endif

#ifdef STM32H5
#define USE_RPM_FILTER
#define USE_DYN_IDLE
#define USE_DYN_NOTCH_FILTER
#define USE_ADC_INTERNAL
#define USE_DMA_SPEC
#define USE_PERSISTENT_OBJECTS
#define USE_LATE_TASK_STATISTICS
#endif

#ifdef STM32C5
#define USE_RPM_FILTER
#define USE_DYN_IDLE
#define USE_DYN_NOTCH_FILTER
#define USE_ADC_INTERNAL
#define USE_DMA_SPEC
#define USE_PERSISTENT_OBJECTS
#define USE_LATE_TASK_STATISTICS
// C591 has no FDCAN hardware; enable CAN only on variants that do (e.g. C593).
#if defined(STM32C593xx) && !defined(ENABLE_CAN)
#define ENABLE_CAN 1
#endif
#endif

#ifdef STM32N6
#define USE_RPM_FILTER
#define USE_DYN_IDLE
#define USE_DYN_NOTCH_FILTER
// N6 lacks factory calibration data for VREFINT/TEMPSENSOR; disable internal ADC for now
//#define USE_ADC_INTERNAL
#define USE_DMA_SPEC
#define USE_PERSISTENT_OBJECTS
#define USE_DMA_RAM
#define USE_RTC_TIME
#define USE_LATE_TASK_STATISTICS
#ifdef USE_DSHOT
/* AXISRAM is cacheable; DMA reads bypass the M55 D-cache so the DShot
 * output/input buffers must be cleaned/invalidated each frame. */
#define USE_DSHOT_CACHE_MGMT
#endif
#endif

#if defined(STM32F4) || defined(STM32F7) || defined(STM32H7) || defined(STM32G4) || defined(STM32H5) || defined(STM32C5) || defined(STM32N6)
#define TASK_GYROPID_DESIRED_PERIOD     125 // 125us = 8kHz
#define SCHEDULER_DELAY_LIMIT           10
#else
#define TASK_GYROPID_DESIRED_PERIOD     1000 // 1000us = 1kHz
#define SCHEDULER_DELAY_LIMIT           100
#endif

// Allow RX and OSD tasks to be scheduled at the second attempt on F411 processors
#if defined(STM32F411xE)
#define SCHEDULER_RELAX_RX  1
#define SCHEDULER_RELAX_OSD 1
#endif

// Set the default cpu_overclock to the first level (108MHz) for F411
// Helps with looptime stability as the CPU is borderline when running native gyro sampling
#if defined(USE_OVERCLOCK) && defined(STM32F411xE)
#define DEFAULT_CPU_OVERCLOCK 1
#else
#define DEFAULT_CPU_OVERCLOCK 0
#endif

#if defined(STM32H7) || defined(STM32N6)
// Move ISRs to fast ram to avoid flash latency.
#define FAST_IRQ_HANDLER FAST_CODE
#else
#define FAST_IRQ_HANDLER
#endif

#if defined(STM32F4) || defined(STM32G4)
// F4 can't DMA to/from CCM (core coupled memory) SRAM (where the stack lives)
// On G4 there is no specific DMA target memory
#define DMA_DATA_ZERO_INIT
#define DMA_DATA
#define STATIC_DMA_DATA_AUTO        static
#elif defined(STM32F7)
// F7 has no cache coherency issues DMAing to/from DTCM, otherwise buffers must be cache aligned
#define DMA_DATA_ZERO_INIT          FAST_DATA_ZERO_INIT
#define DMA_DATA                    FAST_DATA
#define STATIC_DMA_DATA_AUTO        static DMA_DATA
#else
// DMA to/from any memory
#define DMA_DATA_ZERO_INIT          __attribute__ ((section(".dmaram_bss"), aligned(32)))
#define DMA_DATA                    __attribute__ ((section(".dmaram_data"), aligned(32)))
#define STATIC_DMA_DATA_AUTO        static DMA_DATA
#endif

#if defined(STM32F4) || defined(STM32H7) || defined(STM32H5) || defined(STM32C5) || defined(STM32N6)
// Data in RAM which is guaranteed to not be reset on hot reboot
#define PERSISTENT                  __attribute__ ((section(".persistent_data"), aligned(4)))
#endif

#ifdef USE_DMA_RAM
#if defined(STM32H7)
#define DMA_RAM __attribute__((section(".DMA_RAM"), aligned(32)))
#define DMA_RW_AXI __attribute__((section(".DMA_RW_AXI"), aligned(32)))
extern uint8_t _dmaram_start__;
extern uint8_t _dmaram_end__;
#elif defined(STM32N6)
#define DMA_RAM __attribute__((section(".DMA_RAM"), aligned(32)))
#define DMA_RW_AXI __attribute__((section(".DMA_RW_AXI"), aligned(32)))
extern uint8_t _dmaram_start__;
extern uint8_t _dmaram_end__;
#elif defined(STM32G4)
#define DMA_RAM_R __attribute__((section(".DMA_RAM_R")))
#define DMA_RAM_W __attribute__((section(".DMA_RAM_W")))
#define DMA_RAM_RW __attribute__((section(".DMA_RAM_RW")))
#endif
#else
#define DMA_RAM
#define DMA_RW_AXI
#define DMA_RAM_R
#define DMA_RAM_W
#define DMA_RAM_RW
#endif

#define USE_TIMER_MGMT
#define USE_TIMER_AF

// Camera control PWM availability per STM32 family
#if defined(STM32F4) || defined(STM32F7) || defined(STM32H7) || defined(STM32G4) || defined(STM32H5) || defined(STM32C5)
#define CAMERA_CONTROL_HARDWARE_PWM_AVAILABLE
#endif

#if defined(STM32F405)
#define CAMERA_CONTROL_SOFTWARE_PWM_AVAILABLE
#endif

#if defined(STM32F7) || defined(STM32H7) || defined(STM32G4) || defined(STM32H5) || defined(STM32N6) || defined(STM32C5)

