betaflight/betaflight/src/platform/STM32/include/platform/platform.h
#if defined(STM32F7) || defined(STM32H7) || defined(STM32G4) || defined(STM32H5) || defined(STM32C5) || defined(STM32N6)
 // pin AF mode is configured for each pin individually
#define UART_TRAIT_AF_PIN 1
#elif defined(STM32F4)
// all pins on given uart use same AF
#define UART_TRAIT_AF_PORT 1
#else
#error Unknown STM MCU when defining UART_TRAIT_x
#endif

#define PLATFORM_TRAIT_RCC 1

#if defined(STM32F7) || defined(STM32H7) || defined(STM32G4) || defined(STM32H5) || defined(STM32C5) || defined(STM32N6)
#define UART_TRAIT_PINSWAP 1
#endif

#define UART_TRAIT_BIDIR_PP_PREPEND 1

#if defined(STM32F4)
#define UARTHARDWARE_MAX_PINS 4
#elif defined(STM32F7)
#define UARTHARDWARE_MAX_PINS 4
#elif defined(STM32H7)
#define UARTHARDWARE_MAX_PINS 6
#elif defined(STM32G4)
#define UARTHARDWARE_MAX_PINS 3
#elif defined(STM32H5) || defined(STM32C5)
#define UARTHARDWARE_MAX_PINS 5
#elif defined(STM32N6)
#define UARTHARDWARE_MAX_PINS 5
#endif

#if defined(STM32F7) || defined(STM32H7) || defined(STM32G4) || defined(STM32H5) || defined(STM32N6) || defined(STM32C5)
#define UART_REG_RXD(base) (((USART_TypeDef *)(base))->RDR)
#define UART_REG_TXD(base) (((USART_TypeDef *)(base))->TDR)
#elif defined(STM32F4)
#define UART_REG_RXD(base) (((USART_TypeDef *)(base))->DR)
#define UART_REG_TXD(base) (((USART_TypeDef *)(base))->DR)
#endif


#if defined(STM32F4) || defined(STM32F7) || defined(STM32H7) || defined(STM32G4) || defined(STM32H5) || defined(STM32C5) || defined(STM32N6)
#define DMA_TRAIT_CHANNEL 1
#endif

#define SERIAL_TRAIT_PIN_CONFIG 1
#define USB_DP_PIN PA12

#if defined(STM32F7) || defined(STM32H7) || defined(STM32H5) || defined(STM32G4) || defined(STM32N6) || defined(STM32C5)
#define I2C_TRAIT_STATE 1
#endif

#if defined(USE_HAL_DRIVER)

#if defined(HAL_SPI_MODULE_ENABLED)
#define SPI_TRAIT_HANDLE 1
#endif

#if defined(HAL_QSPI_MODULE_ENABLED)
#define QSPI_TRAIT_HANDLE 1
#endif
#endif

#if defined(STM32F4)
#define I2CDEV_COUNT 3
#else
#define I2CDEV_COUNT 4
#endif

// F4 has a different SDIO driver that doesn't require early GPIO init
#if defined(STM32F4) && !defined(ENABLE_SDIO_INIT)
#define ENABLE_SDIO_INIT 0
#endif

// F4 and F7 SDIO drivers use external DMA channel allocation via dma_reqmap;
// H5/H7/N6 SDMMC peripherals use internal DMA and do not need allocation.
#if (defined(STM32F4) || defined(STM32F7)) && !defined(ENABLE_SDIO_EXTERNAL_DMA)
#define ENABLE_SDIO_EXTERNAL_DMA 1
#endif

// QUAD SPI
#if defined(STM32H7) || defined(STM32N6)
#define MAX_QUADSPI_PIN_SEL 3
#endif
#if defined(STM32G4)
#define MAX_QUADSPI_PIN_SEL 4
#endif

// F4 has non-8MHz boards
// G4 for Betaflight allow 8, 16, 24, 26 or 27MHz oscillator
#if defined(STM32F4) || defined(STM32G4)
#define PLATFORM_TRAIT_CONFIG_HSE 1
#endif

#if defined(STM32G4)
#define MCO_SOURCE_COUNT   8
#define MCO_DIVIDER_COUNT  5
#endif

#if defined(STM32H7) || defined(STM32G4) || defined(STM32H5) || defined(STM32C5) || defined(STM32N6)
#define DMA_CHANREQ_STRING "Request"

#if defined(STM32C5)
// STM32C5 has no internal VBAT/4 channel. The shared adc_impl table
// has a placeholder slot pointing at the VREFINT channel which would
// otherwise duplicate the VREFINT entry, throw the DMA dest-buffer
// offset off by one, and corrupt the VREFINT/TEMPSENSOR readings.
#define ADC_INTERNAL_VBAT4_ENABLED 0
#else
#define ADC_INTERNAL_VBAT4_ENABLED 1
#endif
#endif

#if defined(STM32F4) || defined(STM32F7) || defined(STM32H7)
#define DMA_STCH_STRING    "Stream"
#endif

#define PLATFORM_TRAIT_ADC_DEVICE 1

#if defined(STM32F4) || defined(STM32F7)
#ifndef ADC1_DMA_STREAM
#define ADC1_DMA_STREAM DMA2_Stream4
// ST0 or ST4
#endif

#ifndef ADC2_DMA_STREAM
#define ADC2_DMA_STREAM DMA2_Stream3
// ST2 or ST3
#endif

#ifndef ADC3_DMA_STREAM
#define ADC3_DMA_STREAM DMA2_Stream0
// ST0 or ST1
#endif
#endif

#ifdef USE_ITCM_RAM
#if defined(ITCM_RAM_OPTIMISATION) && !defined(DEBUG)
#define FAST_CODE                   __attribute__((section(".tcm_code"))) __attribute__((optimize(ITCM_RAM_OPTIMISATION)))
#else
#define FAST_CODE                   __attribute__((section(".tcm_code")))
#endif
// If a particular target is short of ITCM RAM, defining FAST_CODE_PREF in the target.h file will
// cause functions decorated FAST_CODE_PREF to *not* go into ITCM RAM but if FAST_CODE_PREF is not
// defined for the target, FAST_CODE_PREF will become an alias to FAST_CODE (in the common post
// header file), and functions decorated with FAST_CODE_PREF *will* go into ITCM RAM.

#define FAST_CODE_NOINLINE          NOINLINE
#endif // USE_ITCM_RAM

// noting this is not used anywhere in the codebase at the moment
#ifdef USE_CCM_CODE
#define CCM_CODE                    __attribute__((section(".ccm_code")))
#endif

#ifdef USE_FAST_DATA
#define FAST_DATA_ZERO_INIT         __attribute__ ((section(".fastram_bss"), aligned(4)))
#define FAST_DATA                   __attribute__ ((section(".fastram_data"), aligned(4)))
#endif // USE_FAST_DATA

#if defined(USE_EXST) && !defined(RAMBASED)
#define USE_FLASH_BOOT_LOADER
#endif

#if defined(USE_FLASH_MEMORY_MAPPED)
#if !defined(USE_RAM_CODE)
#define USE_RAM_CODE
#endif

#define MMFLASH_CODE RAM_CODE
#define MMFLASH_CODE_NOINLINE RAM_CODE NOINLINE

#define MMFLASH_DATA FAST_DATA
#define MMFLASH_DATA_ZERO_INIT FAST_DATA_ZERO_INIT
#endif

#ifdef USE_RAM_CODE
// RAM_CODE for methods that need to be in RAM, but don't need to be in the fastest type of memory.
// Note: if code is marked as RAM_CODE it *MUST* be in RAM, there is no alternative unlike functions marked with FAST_CODE/CCM_CODE
#define RAM_CODE                   __attribute__((section(".ram_code")))
#endif

// NVIC priority utility macros
#if defined(USE_HAL_DRIVER)
#define NVIC_PRIORITY_GROUPING NVIC_PRIORITYGROUP_2
#define NVIC_BUILD_PRIORITY(base,sub) (((((base)<<(4-(7-(NVIC_PRIORITY_GROUPING))))|((sub)&(0x0f>>(7-(NVIC_PRIORITY_GROUPING)))))<<4)&0xf0)
#define NVIC_PRIORITY_BASE(prio) (((prio)>>(4-(7-(NVIC_PRIORITY_GROUPING))))>>4)
#define NVIC_PRIORITY_SUB(prio) (((prio)>>4)&(0x0f>>(7-(NVIC_PRIORITY_GROUPING))))
#else
#define NVIC_PRIORITY_GROUPING NVIC_PriorityGroup_2
#define NVIC_BUILD_PRIORITY(base,sub) (((((base)<<(4-(7-(NVIC_PRIORITY_GROUPING>>8))))|((sub)&(0x0f>>(7-(NVIC_PRIORITY_GROUPING>>8)))))<<4)&0xf0)
#define NVIC_PRIORITY_BASE(prio) (((prio)>>(4-(7-(NVIC_PRIORITY_GROUPING>>8))))>>4)
#define NVIC_PRIORITY_SUB(prio) (((prio)>>4)&(0x0f>>(7-(NVIC_PRIORITY_GROUPING>>8))))
#endif

